[
  {
    "name": "The Council of Nicaea",
    "url": "https://en.wikipedia.org/wiki/First_Council_of_Nicaea",
    "type": 0,
    "text": "The Council of Nicaea, held in 325 AD, was the first ecumenical council of the Christian Church, convened to resolve disputes over the nature of Christ and resulting in the Nicene Creed, which affirmed Jesus Christ's divinity alongside the Holy Trinity.",
    "img": "nicaea.png"
  },
  {
    "name": "The Conversion of Emperor Constantine",
    "url": "https://en.wikipedia.org/wiki/Constantine_the_Great_and_Christianity",
    "type": 0,
    "text": "The conversion of Emperor Constantine to Christianity in the early 4th century marked a historic turning point that ended state-sponsored persecution, legitimized the faith within the Roman Empire, and paved the way for Christianity to become a dominant global religion.",
    "img": "constantine.jpg"
  },
  {
    "name": "The Great Schism",
    "url": "https://en.wikipedia.org/wiki/East%E2%80%93West_Schism",
    "type": 0,
    "text": "The Great Schism of 1054 was a pivotal moment in Christian history that formally split the Church into Eastern Orthodoxy and Roman Catholicism, solidifying long-standing theological, political, and cultural divisions between East and West.",
    "img": "schism.jpg"
  },
  {
    "name": "The Ninety-five Theses",
    "url": "https://en.wikipedia.org/wiki/Ninety-five_Theses",
    "type": 0,
    "text": "The Ninety-Five Theses, posted by Martin Luther in 1517, sparked the Protestant Reformation by challenging Church practices like indulgences, leading to widespread religious, political, and social upheaval across Europe.",
    "img": "theses.jpg"
  },
  {
    "name": "The Nestorian Heresy",
    "url": "https://en.wikipedia.org/wiki/Nestorianism",
    "type": 0,
    "text": "The Nestorian Heresy, arising in the 5th century, challenged orthodox Christian doctrine by emphasizing the disunion between Christ's human and divine natures, leading to its condemnation and significant divisions within early Christianity.",
    "img": "nestorian.png"
  },
  {
    "name": "The Filioque Controversy",
    "url": "https://en.wikipedia.org/wiki/Filioque",
    "type": 0,
    "text": "The Filioque Controversy, centered on the Western Church's addition of \"and the Son\" to the Nicene Creed's description of the Holy Spirit's procession, deepened theological rifts that contributed significantly to the East-West Schism in Christianity.",
    "img": "filioque.jpg"
  },
  {
    "name": "The Prophesy of the Dragon and the Beast",
    "url": "https://en.wikipedia.org/wiki/The_Beast_(Revelation)",
    "type": 0,
    "text": "The prophecy of the Beast and the Dragon in the Book of Revelation depicts a cosmic battle between evil forces—represented by the Dragon (Satan) and the Beast (antichrist-like figures)—who wage war against God's people before ultimately being defeated in the final divine judgment.",
    "img": "dragon.jpg"
  },
  {
    "name": "Augustine of Hippo",
    "url": "https://en.wikipedia.org/wiki/Augustine_of_Hippo",
    "type": 0,
    "text": "Saint Augustine of Hippo was a 4th-century bishop and former sinner whose conversion, profound theological writings—especially Confessions and The City of God—and defense of core doctrines shaped the foundation of Western Christianity and Catholic theology.",
    "img": "augustine.jpg"
  },
  {
    "name": "The Shroud of Turin",
    "url": "https://en.wikipedia.org/wiki/Shroud_of_Turin",
    "type": 0,
    "text": "The Shroud of Turin is venerated by many Christians as the possible burial cloth of Jesus, making it a focal point of faith, devotion, and scientific inquiry into the Resurrection despite ongoing debates over its authenticity.",
    "img": "shroud.jpg"
  },
  {
    "name": "The Doctrine of Sola Fide",
    "url": "https://en.wikipedia.org/wiki/Sola_fide",
    "type": 0,
    "text": "The doctrine of sola fide—\"faith alone\"—is a central tenet of Protestant Christianity asserting that salvation comes solely through faith in Jesus Christ, not by works, and was a foundational principle of the Reformation that challenged Catholic teachings on justification.",
    "img": "fide.jpg"
  },
  {
    "name": "The Horus Heresy",
    "url": "https://warhammer40k.fandom.com/wiki/Council_of_Nikaea",
    "type": 1,
    "text": "The Horus Heresy was a galaxy-spanning civil war in which Warmaster Horus, corrupted by Chaos, led half of the Emperor's Space Marine Legions in a revolt against the Imperium.",
    "img": "horus.jpg"
  },
  {
    "name": "The Lectitio Divinitatus",
    "url": "https://warhammer40k.fandom.com/wiki/Lectitio_Divinitatus",
    "type": 1,
    "text": "The foundational religious text declaring the Emperor as a god, it defines the Imperium's theology.",
    "img": "lectitio.PNG"
  },
  {
    "name": "The Age of Apostasy",
    "url": "https://warhammer40k.fandom.com/wiki/Age_of_Apostasy",
    "type": 1,
    "text": "The Age of Apostasy was a second period of interstellar civil war that consumed the Imperium of Man in the early 36th Millennium",
    "img": "apostasy.jpg"
  },
  {
    "name": "The War of the Beast",
    "url": "https://warhammer40k.fandom.com/wiki/War_of_the_Beast",
    "type": 1,
    "text": "The War of the Beast was a massive Ork invasion in the 32nd millennium that nearly toppled the Imperium, forcing desperate alliances and reshaping Imperial military strategy to survive the overwhelming Waaagh!",
    "img": "beast.jpg"
  },
  {
    "name": "The Fall of Cadia",
    "url": "https://warhammer40k.fandom.com/wiki/Cadia#13th_Black_Crusade_and_Fall_of_Cadia",
    "type": 1,
    "text": "The Fall of Cadia marked the catastrophic destruction of the Imperium's strongest fortress world by Abaddon's 13th Black Crusade, shattering the Cadian Gate and allowing Chaos to tear open the galaxy-spanning Great Rift.",
    "img": "cadia.jpg"
  },
  {
    "name": "The Council of Nikaea",
    "url": "https://warhammer40k.fandom.com/wiki/Council_of_Nikaea",
    "type": 1,
    "text": "The Council of Nikaea was an Imperial conclave during the Great Crusade where the Emperor banned the use of psychic powers by Space Marine Librarians, aiming to prevent corruption but inadvertently weakening loyalist forces before the Horus Heresy.",
    "img": "nikaea.jpg"
  },
  {
    "name": "The Indomitus Crusade",
    "url": "https://warhammer40k.fandom.com/wiki/Indomitus_Crusade",
    "type": 1,
    "text": "The Indomitus Crusade is a massive, galaxy-spanning military campaign led by the resurrected Primarch Roboute Guilliman to reclaim and stabilize the Imperium after the opening of the Great Rift shattered its unity and unleashed widespread Chaos incursions.",
    "img": "crusade.jpg"
  },
  {
    "name": "Vashtorr the Arkifane",
    "url": "https://warhammer40k.fandom.com/wiki/Vashtorr",
    "type": 1,
    "text": "Vashtorr the Arkifane is a powerful daemon of the warp and master of infernal technology who allies with Abaddon the Despoiler to construct the mysterious Key using the Arks of Omen, aiming to merge realspace and the warp and reshape the galaxy to his dark, mechanical vision.",
    "img": "vashtorr.jpg"
  },
  {
    "name": "The Doctrine of Greater Good",
    "url": "https://warhammer40k.fandom.com/wiki/Greater_Good",
    "type": 1,
    "text": "The Tau Empire's Doctrine of the Greater Good is a unifying philosophy that emphasizes collective harmony, cooperation, and self-sacrifice for the benefit and advancement of the entire society above individual desires.",
    "img": "greater.jpg"
  },
  {
    "name": "The Sovereign Coronal",
    "url": "https://warhammer40k.fandom.com/wiki/Sovereign_Coronal",
    "type": 1,
    "text": "The Sovereign Coronal is a legendary Necron artifact said to possess immense power, capable of amplifying the command authority of Necron overlords and influencing entire tomb worlds.",
    "img": "coronal.jpg"
  }
]
  